СкладГП/src/InformationRegisters/ЗаданияНаВывозВПодсборки/ЗаданияНаВывозВПодсборки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗаданияНаВывозВПодсборки</name>
  <resources>
    <name>Подсборка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </resources>
  <resources>
    <name>Выполнено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>МассивИдПакетов</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ПланДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаявки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>БазаПУ</name>
    <type>
      <types>CatalogRef.БазыПУ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаявкаНаПогрузку</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

СкладГП/src/InformationRegisters/ОстаткиПакетовНаСкладах/ОстаткиПакетовНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОстаткиПакетовНаСкладах</name>
  <resources>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Досок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Ряд</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Уровень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерПакета</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

СкладГП/src/InformationRegisters/СвойстваПакетов/СвойстваПакетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвойстваПакетов</name>
  <resources>
    <name>Сечение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СечениеТолщина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СечениеШирина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидПродукции</name>
    <type>
      <types>CatalogRef.ВидыПродукции</types>
    </type>
  </resources>
  <resources>
    <name>Сорт</name>
    <type>
      <types>CatalogRef.Сорта</types>
    </type>
  </resources>
  <resources>
    <name>ТипРаспила</name>
    <type>
      <types>CatalogRef.ТипыРаспила</types>
    </type>
  </resources>
  <resources>
    <name>ДлинаТ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДлинаОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДлинаДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Влажность</name>
    <type>
      <types>CatalogRef.Влажности</types>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Досок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаВыпуска</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Порода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <comment>1 - ОК, 2 - Резерв, 3 - ЗапрещенаОтгрузка, 4 - Поврежден</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Партия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПрефиксПроизводителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>БазаПУ</name>
    <type>
      <types>CatalogRef.БазыПУ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерПакета</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

СкладГП/src/InformationRegisters/ЗаданияНаВывозВПодсборки/Forms/ФормаЗаписи/Module.bsl
&НаКлиенте
Процедура ОтметитьВывозПакета(Команда)
	ТекДанные = Элементы.Пакеты.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда Возврат КонецЕсли;
	ПереместитьПакетВПодсборку(ТекДанные.Пакет);
	ОбновлениеДанныхЗаданияНаСервере()
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗаданиеВыполнено(Команда) 
	Ответ = Ждать ВопросАсинх(СтрШаблон("Все пакеты перемещены в %1?", Запись.Подсборка), РежимДиалогаВопрос.ДаНет);
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Для Каждого стр из ТаблицаПакеты Цикл
			ПереместитьПакетВПодсборку(стр.Пакет)	
		КонецЦикла; 
		ОбновлениеДанныхЗаданияНаСервере()
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьПакетВПодсборку(Пакет)
	ЯчейкиСкладаКлиент.РазместитьПакетВЯчейкеКлиент(Пакет, Запись.Подсборка, 0,0,ЛОЖЬ); 
	ПереместитьПакетВПодсборкуЛокально(Пакет);
КонецПроцедуры

&НаСервере
Процедура ПереместитьПакетВПодсборкуЛокально(Пакет)
	НЗ = РегистрыСведений.ОстаткиПакетовНаСкладах.СоздатьНаборЗаписей();
	НЗ.ОбменДанными.Загрузка = ИСТИНА;
	НЗ.Отбор.Склад.Установить(Константы.Склад.Получить());
	НЗ.Отбор.НомерПакета.Установить(Пакет); 
	НЗ.Прочитать();
	Если НЗ.Выбран() Тогда 
		НЗ[0].Ячейка = Запись.Подсборка; 
		НЗ[0].Ряд = 0;
		НЗ[0].Уровень = 0; 
		НЗ.Записать(ИСТИНА);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновлениеДанныхЗадания()
КонецПроцедуры

&НаКлиенте
Асинх Процедура ОбновлениеДанныхЗадания()
	ОбновлениеДанныхЗаданияНаСервере()	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ОтметитьВывозПакетаАсинх(ПакетID)
	ОбновлениеДанныхЗадания()	
КонецПроцедуры

&НаСервере
Процедура ОбновлениеДанныхЗаданияНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаданияНаВывозВПодсборки.МассивИдПакетов КАК МассивИдПакетов,
	|	АдресПУ.Значение КАК Значение
	|ИЗ
	|	Константа.АдресПУ КАК АдресПУ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗаданияНаВывозВПодсборки КАК ЗаданияНаВывозВПодсборки
	|		ПО АдресПУ.Значение = ЗаданияНаВывозВПодсборки.БазаПУ
	|ГДЕ
	|	ЗаданияНаВывозВПодсборки.ЗаявкаНаПогрузку = &ЗаявкаНаПогрузку";
	Запрос.УстановитьПараметр("ЗаявкаНаПогрузку", Запись.ЗаявкаНаПогрузку);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	ОбновлениеТаблицыПакетов(Выборка.МассивИдПакетов.Получить())
КонецПроцедуры

&НаСервере
Процедура ОбновлениеТаблицыПакетов(МассивИдентификаторов)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиПакетовНаСкладах.НомерПакета КАК НомерПакета,
	|	ОстаткиПакетовНаСкладах.Ячейка КАК Ячейка,
	|	ОстаткиПакетовНаСкладах.Ряд КАК Ряд,
	|	ОстаткиПакетовНаСкладах.Уровень КАК Уровень,
	|	АдресПУ.Значение КАК Значение,
	|	СвойстваПакетов.Сечение КАК Сечение,
	|	СвойстваПакетов.Сорт КАК Сорт,
	|	СвойстваПакетов.ДлинаТ КАК ДлинаТ,
	|	СвойстваПакетов.Номер КАК Номер,
	|	СвойстваПакетов.ДатаВыпуска КАК ДатаВыпуска
	|ИЗ
	|	Константа.Склад КАК КонстСклад
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОстаткиПакетовНаСкладах КАК ОстаткиПакетовНаСкладах
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СвойстваПакетов КАК СвойстваПакетов
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.АдресПУ КАК АдресПУ
	|				ПО АдресПУ.Значение = СвойстваПакетов.БазаПУ
	|			ПО ОстаткиПакетовНаСкладах.НомерПакета = СвойстваПакетов.НомерПакета
	|		ПО КонстСклад.Значение = ОстаткиПакетовНаСкладах.Склад
	|ГДЕ
	|	ОстаткиПакетовНаСкладах.НомерПакета В(&МассивПакетов)";
	Запрос.УстановитьПараметр("МассивПакетов", МассивИдентификаторов);
	Выборка = Запрос.Выполнить().Выбрать();
	ТаблицаПакеты.Очистить();
	Пока Выборка.Следующий() Цикл
		Нов = ТаблицаПакеты.Добавить();
		Нов.Пакет = Выборка.НомерПакета;
		Нов.НомерПакета = Выборка.Номер;
		Нов.ТекущийАдрес = СтрШаблон("%1/%2/%3", Выборка.Ячейка, Выборка.Ряд, Выборка.Уровень); 
		Нов.Свойства = СтрШаблон("%1 %2 %3м", Выборка.Сечение, Выборка.Сорт, Выборка.ДлинаТ);
	КонецЦикла;
	
КонецПроцедуры
